# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\hoangp\Documents\GitHub\EE542\firmware\invert\invert.cydsn\invert.cyprj
# Date: Tue, 09 Dec 2014 05:56:53 GMT
#set_units -time ns
create_clock -name {ADC_DelSig_V_Ext_CP_Clk(routed)} -period 500 -waveform {0 250} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} -nominal_period 104.16666666666666 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_DelSig_V_Ext_CP_Clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {ADC_SAR_I_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 43 85} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {ADC_SAR_I_theACLK(fixed-function)} -period 875 -waveform {0 437.5} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 49 97} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 53 105} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {ADC_DelSig_V_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 97 193} [list [get_pins {ClockBlock/aclk_glb_1}]]
create_clock -name {ADC_DelSig_V_theACLK(fixed-function)} -period 2000 -waveform {0 1000} [get_pins {ClockBlock/aclk_glb_ff_1}]
create_generated_clock -name {Clock_LUT} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1591 3179} -nominal_period 33124.999999999993 [list [get_pins {ClockBlock/dclk_glb_4}]]
create_clock -name {Clock_LUT(fixed-function)} -period 33124.999999999993 -waveform {0 16562.5} [get_pins {ClockBlock/dclk_glb_ff_4}]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\hoangp\Documents\GitHub\EE542\firmware\invert\invert.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\hoangp\Documents\GitHub\EE542\firmware\invert\invert.cydsn\invert.cyprj
# Date: Tue, 09 Dec 2014 05:56:42 GMT
